 //1. Створіть програму, яка обчислює факторіал натурального числа n,
 //яке користувач введе з клавіатури.

let a = prompt("Enter the number");
let result = 1;
for (i = 1; i <= a; i++){
     {result = result * i;}
console.log(result);
}


//2. Створіть програму, що виводить на екран
// всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015 … 9999

for ( let b = 998; b <= 9996; b++){
    if( d = b = b += 2) {
    console.log (b);
}

}


//3. Створіть програму, що виводить
// на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17 …
   
for(let a =1, b= 1; a <=55 ; a++, b+= 2){
    console.log(b);
}




// 4.Створіть програму, що виводить на екран 
// всі невід'ємні елементи послідовності 90 85 80 75 70 65 60 …

for ( let i = 94; i >= 0; i--){
    if( d = i -= 4) {
    console.log (i);
}

}


// 5. Створіть програму, 
//що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128 …


       for(let x=1, y=2; x<=20; x++,y*=2){
                console.log(y);
       }
 
// 6. Виведіть на екран всі числа в послідовності 2a-1
//(крок зміни лічильника), де початкове значення a = 2 та які менше 10000.
       

        for(let a = 2; a <= 10000; a = 2*a-1){
            console.log(a);
        }
    
// 7. Виведіть на екран всі двозначні члени послідовності
// 2a+200(крок зміни лічильника), де початкове значення змінної a = -166.


       for( let k = -166; k <= 99; k = 2*k+200){
        console.log(k);
       }

       

